In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName',1980,1981]]
df_new = df_new.head()

# Sort Entire Dataframe based on One Column

In [4]:
df_new

           OdName  1980  1981
0     Afghanistan    16    39
1         Albania     1     0
2         Algeria    80    67
3  American Samoa     0     1
4         Andorra     0     0

In [9]:
df_new.sort_values(1980, axis=0) #By Default ascending=True  #axis=0 => Sort based on ROW

           OdName  1980  1981
3  American Samoa     0     1
4         Andorra     0     0
1         Albania     1     0
0     Afghanistan    16    39
2         Algeria    80    67

In [10]:
df_new.sort_values(1980, axis=0, ascending=False)

           OdName  1980  1981
2         Algeria    80    67
0     Afghanistan    16    39
1         Albania     1     0
3  American Samoa     0     1
4         Andorra     0     0

In [11]:
df_new

           OdName  1980  1981
0     Afghanistan    16    39
1         Albania     1     0
2         Algeria    80    67
3  American Samoa     0     1
4         Andorra     0     0

In [12]:
df_new.sort_values('OdName', axis=0)

           OdName  1980  1981
0     Afghanistan    16    39
1         Albania     1     0
2         Algeria    80    67
3  American Samoa     0     1
4         Andorra     0     0

In [13]:
df_new.sort_values('OdName', axis=0, ascending=False)

           OdName  1980  1981
4         Andorra     0     0
3  American Samoa     0     1
2         Algeria    80    67
1         Albania     1     0
0     Afghanistan    16    39

# Sort Entire Dataframe based on more than One Column

In [14]:
df_new

           OdName  1980  1981
0     Afghanistan    16    39
1         Albania     1     0
2         Algeria    80    67
3  American Samoa     0     1
4         Andorra     0     0

In [17]:
df_new.sort_values([1980,1981])

           OdName  1980  1981
4         Andorra     0     0
3  American Samoa     0     1
1         Albania     1     0
0     Afghanistan    16    39
2         Algeria    80    67

#### First DataFrame will be sorted based on column 1980

In [19]:
df_new.sort_values(1980)

           OdName  1980  1981
3  American Samoa     0     1
4         Andorra     0     0
1         Albania     1     0
0     Afghanistan    16    39
2         Algeria    80    67

#### Then further sort will be applied on other column (1981) only for those rows where it found same value in other column on which Sorting already Applied (1980)

#### Row 3 and 4 holds value 0 for col 1980. So further sort will be applied on col 1981 only for these two Rows in ascending order

In [20]:
df_new.sort_values([1980,1981])

           OdName  1980  1981
4         Andorra     0     0
3  American Samoa     0     1
1         Albania     1     0
0     Afghanistan    16    39
2         Algeria    80    67

# Sort values on a series

In [21]:
df_new[1980]  #Series

0    16
1     1
2    80
3     0
4     0
Name: 1980, dtype: int64

In [23]:
df_new[1980].sort_values() #Sorting the series

3     0
4     0
1     1
0    16
2    80
Name: 1980, dtype: int64

In [24]:
df_new[1980].sort_values().values

array([ 0,  0,  1, 16, 80], dtype=int64)

In [25]:
df_new[1980].sort_values().values.tolist() #Sorted and converted into Array

[0, 0, 1, 16, 80]

# Not Possible to sort if Series contain Mixed Data Type

In [26]:
df_new

           OdName  1980  1981
0     Afghanistan    16    39
1         Albania     1     0
2         Algeria    80    67
3  American Samoa     0     1
4         Andorra     0     0

In [27]:
df_new.loc[5,["OdName",1980,1981]] = [23, 34,50]

In [28]:
df_new

           OdName  1980  1981
0     Afghanistan  16.0  39.0
1         Albania   1.0   0.0
2         Algeria  80.0  67.0
3  American Samoa   0.0   1.0
4         Andorra   0.0   0.0
5              23  34.0  50.0

In [32]:
df_new.sort_values("OdName", axis=0)

TypeError: '<' not supported between instances of 'int' and 'str'